04_Simulation/0.BASELINE/para-database-for-PIML-master/pehill-5-cases-OpenFOAM/case_1p0_refined_32000_cells/0.orig/R
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      R;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor> 
14751
(
(4e-08 1.60931e-07 0 4e-08 0 4e-08)
(4e-08 1.63007e-07 0 4e-08 0 4e-08)
(4e-08 1.65125e-07 2.34761e-31 4e-08 0 4e-08)
(4e-08 1.6766e-07 -2.38365e-31 4e-08 0 4e-08)
(4e-08 1.69594e-07 4.82229e-31 4e-08 0 4e-08)
(4e-08 1.723e-07 -8.3287e-30 4e-08 0 4e-08)
(4e-08 1.75682e-07 0 4e-08 0 4e-08)
(4e-08 1.78992e-07 1.27238e-31 4e-08 0 4e-08)
...
)
;

boundaryField
{
    bottomWall
    {
        type            fixedValue;
        value           uniform (6.66667e-16 0 0 6.66667e-16 0 6.66667e-16);
    }
    defaultFaces
    {
        type            empty;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    topWall
    {
        type            fixedValue;
        value           uniform (6.66667e-16 0 0 6.66667e-16 0 6.66667e-16);
    }
}


// ************************************************************************* //
