04_Simulation/0.BASELINE/para-database-for-PIML-master/pehill-5-cases-OpenFOAM/case_1p0_refined_32000_cells/0.orig/TauDNS
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      TauDNS;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor> 
14751
(
(5.574689102902983527e-07 6.342555882445259540e-09 0.000000000000000000e+00 5.360815520607366051e-10 0.000000000000000000e+00 1.994500579523895233e-07)
(5.574854665523251595e-07 6.481793549307761604e-09 0.000000000000000000e+00 5.468947707536139721e-10 0.000000000000000000e+00 2.024423384788767098e-07)
(5.572525386699007146e-07 6.621732496886605100e-09 0.000000000000000000e+00 5.599679111608343315e-10 0.000000000000000000e+00 2.054421657606631786e-07)
(5.569326737336401766e-07 6.736088891722986887e-09 0.000000000000000000e+00 5.722190730629603779e-10 0.000000000000000000e+00 2.084427023289980921e-07)
(5.569435089229503690e-07 6.850187162728852363e-09 0.000000000000000000e+00 5.872666683253231498e-10 0.000000000000000000e+00 2.116204130700697428e-07)
(5.572537161697030216e-07 6.980636711115464248e-09 0.000000000000000000e+00 6.031494608097729110e-10 0.000000000000000000e+00 2.148346695914708993e-07)
(5.573399077763462147e-07 7.105516705012774760e-09 0.000000000000000000e+00 6.218638313555221303e-10 0.000000000000000000e+00 2.181046136759289887e-07)
(5.575083935087925889e-07 7.211144079250381587e-09 0.000000000000000000e+00 6.395628641525055431e-10 0.000000000000000000e+00 2.214336053395404023e-07)
...
)
;

boundaryField
{
    bottomWall
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            empty;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    topWall
    {
        type            zeroGradient;
    }
}