04_Simulation/0.BASELINE/para-database-for-PIML-master/pehill-5-cases-OpenFOAM/case_1p0_refined_32000_cells/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.1;

boundaryField
{
    bottomWall
    {
        type            omegaWallFunction;
        value           uniform 1e-10;
    }
    topWall
    {
        type            omegaWallFunction;
        value           uniform 1e-10;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
